#+TITLE: Intro to Programming - Variables and Types
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 100 - Lyon College - Spring 2025
#+SEQ_TODO: PRACTICE TODO NEXT | DONE
#+STARTUP: overview hideblocks indent entitiespretty
#+options: toc:nil num:nil ^:nil:
#+property: :header-args:C      :main yes :includes <stdio.h> :results output :exports both
#+property: :header-args:python :session *Python* :python python3 :results output :exports both
#+property: :header-args:R      :session *R* :results graphics output file :exports both
#+property: :header-args:C++    :main yes :includes <iostream> :results output :exports both
* PRACTICE Changing literals

1) Try to change the value of the literal (constant) =8= by assigning
   another integer to it, e.g. =8 = 18=. What's the result?

2) What is the error message when you compile this program:
   #+begin_src C :results none
     8 = 18;
   #+end_src

   Error message:
   #+begin_example
   literal.c: In function ‘main’:
   literal.c:3:8: error: lvalue required as left operand of assignment
       3 |      8 = 18;
         |        ^
   #+end_example

3) Can you understand it? If you don't know what /lvalue/ means, google it.
   #+begin_quote
   *Explanation:* `lvalue` stands for `left value` and stands for an
   object that you can assign a value to. But in the statement, =8= is
   not a variable but a literal or constant. Its memory is *persistent*,
   and not *variable*.
   #+end_quote

4) How then can you change a variable called =foo= from the value =8= to
   =18=? Answer with *two lines* of code.
   #+begin_src C
     int foo = 8; // declare `foo` and define its value
     foo = 18;  // change value of `foo`
   #+end_src

5) Test the code by inserting suitable print statements. Output:
   #+begin_example
   foo = 8
   foo = 18
   #+end_example

   #+begin_src C :results output
     int foo = 8; // declare `foo` and define its value
     printf("foo = %i\n",foo);
     foo = 18;  // change value of `foo`
     printf("foo = %i\n",foo);
   #+end_src

   #+RESULTS:
   : foo = 8
   : foo = 18

** Sample solution:

Link: https://onecompiler.com/c/437ujapsy

#+begin_src C :main no :results output :tangle ../src/variables.c
  /******************************************************
   * variables.c: Declare, define and print variables
   * Input: None                                        
   * Output: two integers and one floating-point variable
   * Author: Marcus Birkenkrahe
   * Date: 02/01/2025 
   ******************************************************/
  #include <stdio.h>

  /* main program */
  int main(void)
  {
    // declare and define variables
    int num = 10;
    int doubleNum = 2 * num;
    float half = 0.5 * num;

    // print results
    printf("The number is: %i\nDouble the number is: %i\nHalf the number is: %f",
           num, doubleNum, half);

    return 0;
  }
#+end_src

#+RESULTS:
: The number is: 10
: Double the number is: 20
: Half the number is: 5.000000

